Catalogs/СообщенияРЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СообщенияРЭМД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обновить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПоследнейОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрируемыеЭлектронныеМедДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРЭМД</Name>
					<Comment>emdrId</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторШаблонаЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транспорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереотправок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВПроцессеРегистрации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлектронныеПодписиЭМД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлуПодписиЭМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольРЭМД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПриПодписиМедДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПодписьМО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД_ЭЦП</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьМинздрава</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпециальностьМинздрава</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Версии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлуЭМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИнтеграцияЕГИСЗСообщенияРЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИнтеграцияЕГИСЗСообщенияРЭМД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторРЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипВызова</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипВызоваРЭМД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипВызоваРЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипВызоваРЭМД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РЭМДПравилаПодписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РЭМДПравилаПодписи</Name>
			<Comment>1.2.643.5.1.13.13.99.2.42</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрируемыеЭлектронныеМедДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиПриПодписиМедДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксКолПодписей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинКолПодписей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Атрибуты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СообщенияРЭМД/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОтправленныеСообщения, "УИДСообщения", Строка(Объект.Ссылка.УникальныйИдентификатор()), ВидСравненияКомпоновкиДанных.Равно);
	
	ДопустимоРедактированиеЭлементовЕГИСЗ = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ДопустимоРедактированиеЭлементовЕГИСЗ();
	
	Элементы.ДанныеШапки.ТолькоПросмотр						= Не ДопустимоРедактированиеЭлементовЕГИСЗ;
	Элементы.СлужебнаяИнформация.ТолькоПросмотр				= Не ДопустимоРедактированиеЭлементовЕГИСЗ;
	Элементы.ДанныеРЭМД.ТолькоПросмотр						= Не ДопустимоРедактированиеЭлементовЕГИСЗ;
	Элементы.ЗакладкаВерсии.ТолькоПросмотр					= Не ДопустимоРедактированиеЭлементовЕГИСЗ;
	Элементы.Ошибки.ТолькоПросмотр							= Не ДопустимоРедактированиеЭлементовЕГИСЗ;
	Элементы.ЗакладкаОтправленныеСообщения.ТолькоПросмотр	= Не ДопустимоРедактированиеЭлементовЕГИСЗ;
	Элементы.Подписи.ТолькоПросмотр							= Не ДопустимоРедактированиеЭлементовЕГИСЗ;
	
	Элементы.ЭлектронныеПодписиЭМДУдалитьПодпись.Доступность				= ДопустимоРедактированиеЭлементовЕГИСЗ Или РольДоступна("ДополнительныеПраваУдалениеЭлектронныхПодписей");
	Элементы.ЭлектронныеПодписиЭМДКонтекстноеМенюУдалитьПодпись.Доступность	= ДопустимоРедактированиеЭлементовЕГИСЗ Или РольДоступна("ДополнительныеПраваУдалениеЭлектронныхПодписей");
	
	СформироватьЗаголовокСостояния();
	
	Элементы.ЗакладкаВерсии.Видимость = Объект.Версии.Количество() > 0;
	
	ФилиалДокумента = Объект.Документ.Филиал;
	
	Элементы.НомерВерсии.Видимость = Объект.НомерВерсии > 0;
	Элементы.ВерсииНомерВерсии.Видимость = Объект.НомерВерсии > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПосмотретьФайл(Команда)
	
	Если Команда.Имя = "ПосмотретьФайл" Тогда
		ПутьКФайлуЭМД = Объект.ПутьКФайлуЭМД;
	ИначеЕсли Команда.Имя = "ПосмотретьФайлВерсии" Тогда
		ПутьКФайлуЭМД = Элементы.Версии.ТекущиеДанные.ПутьКФайлуЭМД;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не удалось найти файл на сервере.'"));
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = НайтиФайлНаСервере(ПутьКФайлуЭМД);
	Если ЗначениеЗаполнено(ДанныеФайла.ФайлНайден) Тогда
		ИВФ = ПолучитьИмяВременногоФайла(ДанныеФайла.РасширениеФайла);
		ДанныеФайла.ДД.Записать(ИВФ);
		ЗапуститьПриложение(ИВФ);
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не удалось найти файл на сервере.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьПредставлениеФайла(Команда)
	
	Если Команда.Имя = "ПосмотретьПредставлениеФайла" Тогда
		ПутьКФайлуЭМД = Объект.ПутьКФайлуЭМД;
	ИначеЕсли Команда.Имя = "ПосмотретьПредставлениеФайлаВерсии" Тогда
		ПутьКФайлуЭМД = Элементы.Версии.ТекущиеДанные.ПутьКФайлуЭМД;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не удалось найти файл на сервере.'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.СообщенияРЭМД.Форма.ПросмотрЭМД", Новый Структура("ПутьКФайлуЭМД, ВидЭМД, Филиал", ПутьКФайлуЭМД, Объект.ВидДокумента, ФилиалДокумента));
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЛог(Команда)
	
	ВыбранноеСообщение = Элементы.ОтправленныеСообщения.ТекущиеДанные;
	Если ВыбранноеСообщение <> Неопределено Тогда
		ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогСохраненияФайла.ПолноеИмяФайла = "Запросы РЭМД " + Строка(ВыбранноеСообщение.УИДСообщения);
		ДиалогСохраненияФайла.Фильтр = "ZIP-архив(*.zip)|*.zip";
		ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
		ДиалогСохраненияФайла.Заголовок = "Выберите куда сохранить файл";
		
		ПараметрыОповещения = Новый Структура("УИДСообщения", ВыбранноеСообщение.УИДСообщения);
		ПослеВыбораСохраняемогоФайлаЛога = Новый ОписаниеОповещения("ПослеВыбораСохраняемогоФайлаЛога", ЭтотОбъект, ПараметрыОповещения);
		ДиалогСохраненияФайла.Показать(ПослеВыбораСохраняемогоФайлаЛога);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодписьМО(Команда)
	
	ОбновитьПодписьМОНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)
	
	Если Команда.Имя = "СохранитьФайл" Тогда
		ПутьКФайлуЭМД = Объект.ПутьКФайлуЭМД;
	ИначеЕсли Команда.Имя = "СохранитьФайлВерсии" Тогда
		ПутьКФайлуЭМД = Элементы.Версии.ТекущиеДанные.ПутьКФайлуЭМД;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не удалось найти файл на сервере.'"));
		Возврат;
	КонецЕсли;
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.ПолноеИмяФайла = ПутьКФайлуЭМД;
	ДиалогСохраненияФайла.Фильтр = "XML(*.xml)|*.xml";
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок = "Выберите куда сохранить файл";
	
	ПослеВыбораСохраняемогоФайлаЭМД = Новый ОписаниеОповещения("ПослеВыбораСохраняемогоФайлаЭМД", ЭтотОбъект, Новый Структура("ПутьКФайлуЭМД", ПутьКФайлуЭМД));
	ДиалогСохраненияФайла.Показать(ПослеВыбораСохраняемогоФайлаЭМД);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЛогИФайл(Команда)
	
	ВыбранноеСообщение = Элементы.ОтправленныеСообщения.ТекущиеДанные;
	Если ВыбранноеСообщение <> Неопределено Тогда
		ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
		ДиалогСохраненияФайла.Заголовок = "Выберите куда сохранить файлы";
		
		ПараметрыОповещения = Новый Структура("УИДСообщения", ВыбранноеСообщение.УИДСообщения);
		ПослеВыбораСохраняемогоФайлаЛога = Новый ОписаниеОповещения("ПослеВыбораСохраняемогоКаталога", ЭтотОбъект, ПараметрыОповещения);
		ДиалогСохраненияФайла.Показать(ПослеВыбораСохраняемогоФайлаЛога);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПодпись(Команда)
	
	ВыделенныеСтроки = Элементы.ЭлектронныеПодписиЭМД.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Сообщить(НСтр("ru='Строки подписи не выбраны'"));
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаУдаленияПодписи", ЭтотОбъект, Новый Структура("ВыделенныеСтроки", ВыделенныеСтроки)), НСтр("ru='Удалить выбранные подписи?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтзывЭМД(Команда)
	
	ОткрытьФорму("Справочник.СообщенияРЭМД.Форма.ОтзывЭМД", Новый Структура("СообщениеРЭМД", Объект.Ссылка));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтправитьПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ИдентификаторРЭМД) Тогда
		Оповещение = Новый ОписаниеОповещения("УстановкаОтметкиОтправитьЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Сообщение уже зарегистрировано в РЭМД. Пометить на отправку?'"), РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВПроцессеРегистрацииПриИзменении(Элемент)
	
	Если Не Объект.ВПроцессеРегистрации Тогда
		Оповещение = Новый ОписаниеОповещения("ПрерываниеПроцессаРегистрации", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Процесс регистрации ЭМД в РЭМД ещё не завершён. Вы уверены, что хотите прервать его?'"), РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерываниеПроцессаРегистрации(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Объект.ВПроцессеРегистрации = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НайтиФайлНаСервере(ПутьКФайлуЭМД)
	
	Результат = Новый Структура("ФайлНайден, ДД, РасширениеФайла", Ложь, Неопределено, "");
	
	ВыбФайл = Новый Файл(ИнтеграцияЕГИСЗ_РЭМД.ПолучитьПолныйПутьПоОтносительномуПутиВХранилищеЭМД(ПутьКФайлуЭМД, ФилиалДокумента));
	Если ВыбФайл.Существует() Тогда
		Результат.ДД				= Новый ДвоичныеДанные(ВыбФайл.ПолноеИмя);
		Результат.ФайлНайден		= Истина;
		Результат.РасширениеФайла	= ВыбФайл.Расширение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораСохраняемогоФайлаЛога(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		СохранитьАрхивЛога(Результат[0], ДополнительныеПараметры.УИДСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСохраняемогоФайлаЭМД(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		СохранитьФайлЭМД(Результат[0], ДополнительныеПараметры.ПутьКФайлуЭМД);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСохраняемогоКаталога(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ИмяАрхиваЛога = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Результат[0]) + "Запросы РЭМД " + Строка(ДополнительныеПараметры.УИДСообщения) + ".zip";
		ИмяФайлаЭМД = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Результат[0]) + Объект.ПутьКФайлуЭМД;
		СохранитьАрхивЛога(ИмяАрхиваЛога, ДополнительныеПараметры.УИДСообщения);
		СохранитьФайлЭМД(ИмяФайлаЭМД, Объект.ПутьКФайлуЭМД);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьАрхивЛога(ПутьКФайлу, УИДСообщения)
	
	ТекстОшибки = "";
	ДДАрхиваСЛогами = ПолучитьАрхивСЛогами(УИДСообщения, ТекстОшибки, ФилиалДокумента);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ПоказатьПредупреждение(, ТекстОшибки);
	Иначе
		ДДАрхиваСЛогами.Записать(ПутьКФайлу);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлЭМД(ПутьКФайлу, ПутьКФайлуЭМД)
	
	ДанныеФайла = НайтиФайлНаСервере(ПутьКФайлуЭМД);
	Если Не ЗначениеЗаполнено(ДанныеФайла.ФайлНайден) Тогда
		ПоказатьПредупреждение(,НСтр("ru='Не удалось найти файл на сервере.'"));
	Иначе
		ДанныеФайла.ДД.Записать(ПутьКФайлу);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАрхивСЛогами(УИДСообщения, ТекстОшибки, ФилиалДокумента)
	
	АрхивЛогов = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьПутьКАрхивуЛогов(ФилиалДокумента);
	
	ИмяФайлаЛогов = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(АрхивЛогов, УИДСообщения + ".zip");
	ФайлЛогов = Новый Файл(ИмяФайлаЛогов);
	Если Не ФайлЛогов.Существует() Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru='Архив логов по сообщению не найден: %1'"), ИмяФайлаЛогов);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Новый ДвоичныеДанные(ИмяФайлаЛогов);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПодписьМОНаСервере()
	
	ДанныеПодписи = Новый Структура;
	ДанныеПодписи.Вставить("МедицинскийДокумент",	Объект.Документ);
	ДанныеПодписи.Вставить("Роль",					Неопределено);
	ДанныеПодписи.Вставить("УИД",					Новый УникальныйИдентификатор(Объект.ИдентификаторДокумента));
	ДанныеПодписи.Вставить("ПутьКФайлу",			ИнтеграцияЕГИСЗ_РЭМД.ПолучитьПолныйПутьПоОтносительномуПутиВХранилищеЭМД(Объект.ПутьКФайлуЭМД, ФилиалДокумента));
	ДанныеПодписи.Вставить("СообщениеРЭМД",			Объект.Ссылка);
	ДанныеПодписи.Вставить("ПодписываемыеДанные",	ИнтеграцияЕГИСЗВызовСервера.ПолучитьДДФайла(ДанныеПодписи.ПутьКФайлу));
	
	Объекты = Новый Массив;
	Объекты.Добавить(ДанныеПодписи.МедицинскийДокумент);
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("Объекты", Объекты);
	ОбработчикЗавершения = Новый ОписаниеОповещения("ПодписатьФайлЭМДВРолиЗавершение", ЭтотОбъект, ПараметрыОбработчика);
	
	НаборДанных = Новый Массив;
	МассивДанныхОбъектов = Новый Массив;
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("ОбработчикЗавершения", ОбработчикЗавершения);
	ПараметрыВыполнения.Вставить("ИдентификаторФормы",	 УникальныйИдентификатор);
	ПараметрыВыполнения.Вставить("МассивДанныхОбъектов", МассивДанныхОбъектов);
	
	МассивДанныхОбъектов.Добавить(ДанныеПодписи);
	
	ТекущиеПараметрыВыполнения = Новый Структура;
	ТекущиеПараметрыВыполнения.Вставить("ИдентификаторФормы",	УникальныйИдентификатор);
	ТекущиеПараметрыВыполнения.Вставить("ПодписываемыеДанные",	ДанныеПодписи.ПодписываемыеДанные);
	
	ЭлементДанных = Новый Структура;
	ЭлементДанных.Вставить("Представление",		ДанныеПодписи.МедицинскийДокумент);
	ЭлементДанных.Вставить("Данные",			ДанныеПодписи.ПодписываемыеДанные);
	ЭлементДанных.Вставить("Объект",			Новый ОписаниеОповещения("ПриПолученииПодписи", ОбщегоНазначенияКлиент.ОбщийМодуль("доп_СертификатыЭЦПКлиент"), ТекущиеПараметрыВыполнения));
	ЭлементДанных.Вставить("СообщениеРЭМД",		ДанныеПодписи.СообщениеРЭМД);
	ЭлементДанных.Вставить("ИмяФайла",			ДанныеПодписи.ПутьКФайлу);
	ЭлементДанных.Вставить("Роль",				ДанныеПодписи.Роль);
	ЭлементДанных.Вставить("УИД",				ДанныеПодписи.УИД);
	ЭлементДанных.Вставить("ПодписанФайлЭМД",	Истина);
	ЭлементДанных.Вставить("ИдентификаторРоли",	Неопределено);
	
	НаборДанных.Добавить(ЭлементДанных);
	
	Операция = НСтр("ru = 'Подписание'");
	ЗаголовкиСтруктура = Новый Структура;
	ЗаголовкиСтруктура.Вставить("ЗаголовокДанных");
	ЗаголовокДанных = ЗаголовкиСтруктура.ЗаголовокДанных;
	ЗаголовокДанных = НСтр("ru = 'Объект'");
	ПредставлениеНабора = ЗаголовокДанных;
	
	СертификатыМО = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьСертификатыМОПользователя();
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("ПоказатьКомментарий",	Истина);
	ОписаниеДанных.Вставить("ИдентификаторФормы",	УникальныйИдентификатор);
	ОписаниеДанных.Вставить("Операция",				Операция);
	ОписаниеДанных.Вставить("ЗаголовокДанных",		ЗаголовокДанных);
	ОписаниеДанных.Вставить("НаборДанных",			НаборДанных);
	ОписаниеДанных.Вставить("ПредставлениеНабора",	ПредставлениеНабора);
	ОписаниеДанных.Вставить("ОтборСертификатов",	СертификатыМО);
	
	ОбработчикПродолжения = Новый ОписаниеОповещения("ПослеПодписанияОбъектов", ОбщегоНазначенияКлиент.ОбщийМодуль("доп_СертификатыЭЦПКлиент"), ПараметрыВыполнения);
	
	МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
	МодульЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, , ОбработчикПродолжения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьФайлЭМДВРолиЗавершение(Результат, Параметры) Экспорт
	
	Если Не Результат.Успех Тогда
		Сообщить("Не удалось подписать " + Параметры.СообщениеРЭМД);
		Возврат;
	КонецЕсли;
	
	// При сохранении данных подписи надо сохранить признак подписания файла ЭМД.
	Параметры.Вставить("ПодписанФайлЭМД", Истина);
	доп_СертификатыЭЦПКлиент.ПослеПодписанияОбъекта(Результат, Параметры);
	ОбновитьТЧСообщенияРЭМД(Параметры);
	
	Прочитать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьТЧСообщенияРЭМД(ПараметрыОбновления)
	
	Возврат Справочники.СообщенияРЭМД.ОбновитьТЧСообщенияРЭМД(ПараметрыОбновления);
	
КонецФункции

&НаСервере
Процедура СформироватьЗаголовокСостояния()
	
	Состояние = "";
	КоличествоТребуемыхПодписей = ПолучитьКоличествоТребуемыхПодписейСообщения();
	
	Если Объект.Отправить Или Объект.Обновить Тогда
		Состояние = "Готово к отправке";
	ИначеЕсли ЗначениеЗаполнено(Объект.ТекстПоследнейОшибки) Тогда
		Состояние = "Возникла ошибка при отправке (см. ""Ошибки"")";
	ИначеЕсли ЕстьОшибкиОтправленногоСообщения() Тогда
		Состояние = "Ответ из РЭМД содержит ошибку (см. ""Отправленные сообщения""). Обратитесь в СТП РЭМД.";
	ИначеЕсли ЗначениеЗаполнено(Объект.ИдентификаторРЭМД) Тогда
		Состояние = "Зарегистрирован";
	ИначеЕсли КоличествоТребуемыхПодписей.ПодписиМО > Объект.ЭлектронныеПодписиЭМД.НайтиСтроки(Новый Структура("ЭтоПодписьМО", Истина)).Количество() Тогда
		Состояние = "Не хватает подписи МО";
	ИначеЕсли КоличествоТребуемыхПодписей.ПодписиВрача > Объект.ЭлектронныеПодписиЭМД.НайтиСтроки(Новый Структура("ЭтоПодписьМО", Ложь)).Количество() Тогда
		Состояние = "Не хватает подписей врача";
	ИначеЕсли ЕстьОтправленныеСообщенияБезОтвета() Тогда
		Состояние = "Сообщение отправлено в РЭМД, но ответ пока не получен";
	КонецЕсли;
		
	Элементы.СостояниеСообщения.Заголовок = Состояние;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоТребуемыхПодписейСообщения()
	
	КоличествоТребуемыхПодписей = Новый Структура("ПодписиВрача, ПодписиМО", 0, 0);
	СтрокаАтрибута = Объект.ВидДокумента.Атрибуты.Найти("MO_SIGN");
	
	Если СтрокаАтрибута <> Неопределено Тогда
		Попытка
			Если Булево(СтрокаАтрибута.Значение) Тогда
				КоличествоТребуемыхПодписей.ПодписиМО = 1;
			КонецЕсли;
		Исключение КонецПопытки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(РЭМДПравилаПодписи.МинКолПодписей) КАК МинКолПодписей
		|ИЗ
		|	Справочник.РЭМДПравилаПодписи КАК РЭМДПравилаПодписи
		|ГДЕ
		|	НЕ РЭМДПравилаПодписи.ПометкаУдаления
		|	И НЕ РЭМДПравилаПодписи.Архив
		|	И РЭМДПравилаПодписи.ВидДокумента = &ВидЭМД";
	
	Запрос.УстановитьПараметр("ВидЭМД", Объект.ВидДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КоличествоТребуемыхПодписей.ПодписиВрача = Выборка.МинКолПодписей;
	КонецЕсли;
	
	Возврат КоличествоТребуемыхПодписей;
	
КонецФункции

&НаСервере
Функция ЕстьОшибкиОтправленногоСообщения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВЫРАЗИТЬ(ИнтеграцияЕГИСЗСообщенияРЭМД.ТекстОшибки КАК СТРОКА(100)) КАК ТекстОшибки
		|ИЗ
		|	РегистрСведений.ИнтеграцияЕГИСЗСообщенияРЭМД КАК ИнтеграцияЕГИСЗСообщенияРЭМД
		|ГДЕ
		|	ИнтеграцияЕГИСЗСообщенияРЭМД.ИдентификаторДокумента = &ИдентификаторДокумента";
	
	Запрос.УстановитьПараметр("ИдентификаторДокумента", Объект.ИдентификаторДокумента);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат ЗначениеЗаполнено(Выборка.ТекстОшибки);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ЕстьОтправленныеСообщенияБезОтвета()
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИнтеграцияЕГИСЗСообщенияРЭМД.ДатаСообщения КАК ДатаСообщения,
		|	ИнтеграцияЕГИСЗСообщенияРЭМД.ДатаОтвета КАК ДатаОтвета
		|ИЗ
		|	РегистрСведений.ИнтеграцияЕГИСЗСообщенияРЭМД КАК ИнтеграцияЕГИСЗСообщенияРЭМД
		|ГДЕ
		|	ИнтеграцияЕГИСЗСообщенияРЭМД.ИдентификаторДокумента = &ИдентификаторДокумента
		|	И ИнтеграцияЕГИСЗСообщенияРЭМД.ТипВызова = ЗНАЧЕНИЕ(Перечисление.ТипВызоваРЭМД.Отправка)";
	
	Запрос.УстановитьПараметр("ИдентификаторДокумента", Объект.ИдентификаторДокумента);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат ЗначениеЗаполнено(Выборка.ДатаСообщения) И Не ЗначениеЗаполнено(Выборка.ДатаОтвета);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура УстановкаОтметкиОтправитьЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.Отправить = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаУдаленияПодписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиКУдалению = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из ДополнительныеПараметры.ВыделенныеСтроки Цикл
		СтрокиКУдалению.Добавить(Объект.ЭлектронныеПодписиЭМД.НайтиПоИдентификатору(ВыделеннаяСтрока));
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		Объект.ЭлектронныеПодписиЭМД.Удалить(СтрокаКУдалению);
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	
	Элементы.ВПроцессеРегистрации.Видимость = Объект.ВПроцессеРегистрации;
	Элементы.Отправить.ТолькоПросмотр = Объект.ПометкаУдаления Или Объект.ВПроцессеРегистрации;
	Элементы.ФормаОтзывЭМД.Видимость = ЗначениеЗаполнено(Объект.ИдентификаторРЭМД);
	
КонецПроцедуры

#КонецОбласти
